binary_number = input("Введите двоичное число: ")
if set(binary_number) <= {"1", "0", "b"}:
    if binary_number == "0b" or binary_number == "b":
        print("Нет")
    elif set(binary_number[2:]) <= {"1", "0"} and \
       {binary_number[:2]} != {"1b"} and \
       {binary_number[:2]} != {"bb"}:
        print("Да")    
    else:
        print("Нет")        
else:
    print("Нет")
    

# Введите двоичное число: 0b010100101
# Да

# Введите двоичное число: 1b10101100101001
# Нет

# Введите двоичное число: 1
# Да

# Введите двоичное число: 0
# Да

# Введите двоичное число: 10101001001010
# Да

# Введите двоичное число: b1010101010
# Да

# Введите двоичное число: b
# Нет


# Введите двоичное число: 1b101001010
# Нет

    
